УРВ_файловая/src/DataProcessors/РасписаниеЛК/РасписаниеЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасписаниеЛК</name>
  <attributes>
    <name>ТолькоПоСотруднику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЛегенду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКолонкиДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоСотрудникам</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеДействия</name>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасписания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ПользователиСервисов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТемаВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияЭлементаРасписанияЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.РезультатыКонсультации</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаписи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйСтатус</name>
      <type>
        <types>EnumRef.ИтоговыеСтатусыРасписанияЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистраторЗаписи</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистраторРезультата</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветТекста</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноДляСамозаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрочнаяЗапись</name>
      <comment>Срочная запись (Перенести при возможности на более ранний срок)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписи</name>
      <type>
        <types>EnumRef.ТипыЗаписейЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайнийСрок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьЗамещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеТелефоны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РаботаНазвание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УРВ_файловая/src/InformationRegisters/РолиСотрудниковЛК/РолиСотрудниковЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиСотрудниковЛК</name>
  <resources>
    <name>ДоступноСоздание</name>
    <comment>Сотрудник может создать новую запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноИзменение</name>
    <comment>Сотрудник может изменить запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПерепланирование</name>
    <comment>Сотрудник может перенести свою запись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноБлокировка</name>
    <comment>Сотрудник может блокировать свою запись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноОтменаБлокировки</name>
    <comment>Сотрудник может отменить свою запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПросмотрДругихСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиСотрудниковЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Documents/ОтменаЗаписиНаЛК/ОтменаЗаписиНаЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтменаЗаписиНаЛК</name>
  <registerRecords>InformationRegister.РасписаниеКонсультаций</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаписиНаЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

УРВ_файловая/src/DataProcessors/РасписаниеЛК/Forms/ФормаПереносаСрочнойЗаписи/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	ВыбраннаяСтрока = Элементы.ТаблицаРасписания.ТекущиеДанные;
	Если ВыбраннаяСтрока = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	ОбработатьВыборСтроки(ВыбраннаяСтрока)
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборСтроки(Элементы.ТаблицаРасписания.ДанныеСтроки(ВыбраннаяСтрока));
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработатьВыборСтроки(ВыбраннаяСтрока)
	
	Если Не ПроверитьЗаполнение() Тогда
		ВозВрат;
	КонецЕсли;
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Сотрудник"			, ВыбраннаяСтрока.Сотрудник);
	СтруктураСтроки.Вставить("ДатаВремяНачала"		, ВыбраннаяСтрока.ДатаВремяНачала);
	СтруктураСтроки.Вставить("Контрагент"			, ВыбраннаяСтрока.Контрагент);
	СтруктураСтроки.Вставить("КонтактноеЛицо"		, ВыбраннаяСтрока.КонтактноеЛицо);
	СтруктураСтроки.Вставить("ВидУслуги"			, ВыбраннаяСтрока.ВидУслуги);
	СтруктураСтроки.Вставить("ТемаВопроса"			, ВыбраннаяСтрока.ТемаВопроса);
	СтруктураСтроки.Вставить("КомментарийЗаписи"	, ВыбраннаяСтрока.КомментарийЗаписи);
	СтруктураСтроки.Вставить("ТипЗаписи"			, ВыбраннаяСтрока.ТипЗаписи);
	СтруктураСтроки.Вставить("СрочнаяЗапись"		, ВыбраннаяСтрока.СрочнаяЗапись);
	СтруктураСтроки.Вставить("КонтактныеТелефоны"	, ВыбраннаяСтрока.КонтактныеТелефоны);

	ТекстОшибки = "";
	Если Не СоздатьДокументыНаСервере(СтруктураСтроки, ТекстОшибки) Тогда
		ВозВрат;
	КонецЕсли;
	
	СтруктураВозВрата = Новый Структура;
	СтруктураВозВрата.Вставить("РезультатОткрытия"			, Истина);
	Закрыть(СтруктураВозВрата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРасписанияНаСервере()
	
	ТекущаяДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	#Область Запрос
	"ВЫБРАТЬ
	|	РасписаниеКонсультацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РасписаниеКонсультацийСрезПоследних.Работа КАК Работа,
	|	РасписаниеКонсультацийСрезПоследних.Проект КАК Проект,
	//|	РасписаниеКонсультацийСрезПоследних.Задание КАК Задание,
	//|	РасписаниеКонсультацийСрезПоследних.ПакетЧасов КАК ПакетЧасов,
	|	РасписаниеКонсультацийСрезПоследних.Событие КАК Событие,
	|	РасписаниеКонсультацийСрезПоследних.ДатаВремяНачала КАК ДатаВремяНачала,
	|	РасписаниеКонсультацийСрезПоследних.Контрагент,
	|	РасписаниеКонсультацийСрезПоследних.КонтактноеЛицо,
	|	РасписаниеКонсультацийСрезПоследних.НеДействует,
	|	РасписаниеКонсультацийСрезПоследних.Состояние,
	|	РасписаниеКонсультацийСрезПоследних.ДатаВремяОкончания,
	|	РасписаниеКонсультацийСрезПоследних.Продолжительность,
	|	РасписаниеКонсультацийСрезПоследних.ВидУслуги,
	|	РасписаниеКонсультацийСрезПоследних.ТемаВопроса,
	|	РасписаниеКонсультацийСрезПоследних.КомментарийЗаписи,
	|	РасписаниеКонсультацийСрезПоследних.ТипЗаписи,
	|	РасписаниеКонсультацийСрезПоследних.СрочнаяЗапись,
	|	РасписаниеКонсультацийСрезПоследних.КонтактныеТелефоны
	|ИЗ
	|	РегистрСведений.РасписаниеКонсультаций.СрезПоследних(
	|			&Момент,
	|			&УсловиеПоСотруднику
	|				И ДатаВремяНачала > &ДатаВремяНачала
	|				И &УсловиеДаты) КАК РасписаниеКонсультацийСрезПоследних
	|ГДЕ
	|	НЕ РасписаниеКонсультацийСрезПоследних.НеДействует
	|	И РасписаниеКонсультацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЭлементаРасписанияЛК.ЗаписанКлиент)
	|	И РасписаниеКонсультацийСрезПоследних.Работа = &Работа
	|	И РасписаниеКонсультацийСрезПоследних.Проект = &Проект
	|	И РасписаниеКонсультацийСрезПоследних.СрочнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДатаВремяНачала";
	#КонецОбласти
	
	Момент = Неопределено;
	
	ДР = Бор_ПовторноеИспользованиеКлиентСервер.ПолучитьДоступностьРолей();
	ДоступностьПодчиненныхПодразделенийЛК	= Истина;
	ДоступностьСвоегоПодразделенияЛК		= Истина;
	ДоступностьВсегоДляПП					= БоР_ОбщийМодульКлиентСервер.ВБулево(БоР_ОбщийМодуль.ПолучитьНастройку("ЛК_ПолнымПравамДоступныВсеСотрудники"));
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотруднику", "Сотрудник = &Сотрудник");
		Запрос.УстановитьПараметр("Сотрудник"		, Сотрудник);
	ИначеЕсли ДР.ПолныеПрава И ДоступностьВсегоДляПП Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотруднику", "ИСТИНА");
	Иначе // все доступные
		// возможно, надо заменить "В" на соединения с ВТ, но при малом объеме списка - и так неплохо
		МассивСотрудников = РегистрыСведений.РолиСотрудниковЛК.ПолучитьМассивДоступныхСотрудников(ДоступностьПодчиненныхПодразделенийЛК, ДоступностьСвоегоПодразделенияЛК);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотруднику", "Сотрудник В (&МассивСотрудников)");
		Запрос.УстановитьПараметр("МассивСотрудников"			, МассивСотрудников);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		УсловиеДаты = "ДатаВремяНачала >= &ДатаНачала
		|				И ДатаВремяНачала <= &ДатаОкончания";
	Иначе
		УсловиеДаты = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДаты", УсловиеДаты);
	
	Запрос.УстановитьПараметр("Момент"				, Момент);
	Запрос.УстановитьПараметр("ДатаВремяНачала"		, ДатаВремяНачала);
	Запрос.УстановитьПараметр("ДатаНачала"			, НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания"		, КонецДня(Дата));
	Запрос.УстановитьПараметр("Работа"				, Работа);
	Запрос.УстановитьПараметр("Проект"				, Проект);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	
	ТаблицаРасписания.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БоР_ОбщийМодуль.ЗаполнитьРеквизитыИзПараметров(ЭтаФорма, Неопределено);
	Дата				= ИсходнаяСтруктура.ДатаВремяНачала;
	СотрудникПриемник	= ИсходнаяСтруктура.Сотрудник;
	ЗаполнитьТаблицуРасписанияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ЗаполнитьТаблицуРасписанияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТаблицуРасписанияНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыНаСервере(ВыбраннаяСтрока, ТекстОшибки = Неопределено) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	МассивДокументов = Новый Массив;
	
	ДокументОбъект = Документы.ОтменаЗаписиНаЛК.СоздатьДокумент();
	ДокументОбъект.Дата					= ТекущаяДата;
	ДокументОбъект.ИсточникСоздания		= "РасписаниеЛК";
	ДокументОбъект.Сотрудник			= ВыбраннаяСтрока.Сотрудник;
	ДокументОбъект.ДатаВремяНачала		= ВыбраннаяСтрока.ДатаВремяНачала;
	ДокументОбъект.ПричинаОтмены		= ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаписиНаЛК.Перенос");
	МассивДокументов.Добавить(ДокументОбъект);
	
	ДокументОбъект = Документы.ЗаписьНаЛК.СоздатьДокумент();
	ДокументОбъект.Дата					= ТекущаяДата;
	ДокументОбъект.ИсточникСоздания		= "РасписаниеЛК";
	ДокументОбъект.Сотрудник			= ИсходнаяСтруктура.Сотрудник;
	ДокументОбъект.ДатаВремяНачала		= ИсходнаяСтруктура.ДатаВремяНачала;
	ДокументОбъект.Контрагент			= ВыбраннаяСтрока.Контрагент;
	ДокументОбъект.КонтактноеЛицо		= ВыбраннаяСтрока.КонтактноеЛицо;
	ДокументОбъект.ВидУслуги			= ВыбраннаяСтрока.ВидУслуги;
	ДокументОбъект.ТемаВопроса			= ВыбраннаяСтрока.ТемаВопроса;
	ДокументОбъект.КомментарийЗаписи	= ВыбраннаяСтрока.КомментарийЗаписи;
	//Лобашова 89291 23.07.2019 +
	ДокументОбъект.Событие				= ПолучитьОбращение();
	//Лобашова 89291 23.07.2019 -
	ДокументОбъект.ТипЗаписи			= ВыбраннаяСтрока.ТипЗаписи;
	ДокументОбъект.СрочнаяЗапись		= ВыбраннаяСтрока.СрочнаяЗапись;
	ДокументОбъект.КонтактныеТелефоны	= ВыбраннаяСтрока.КонтактныеТелефоны;
	МассивДокументов.Добавить(ДокументОбъект);

	#Область Проведение_документов
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Для каждого ДокументОбъект Из МассивДокументов Цикл
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Исключение
			ОтменитьТранзакцию();
			#Область Вывод_сообщений
			СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
			Если СообщенияПользователю.Количество() > 0 Тогда // есть что сказать
				ТекстОшибки = "";
				Для каждого СообщениеПользователю Из СообщенияПользователю Цикл
					ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + СообщениеПользователю.Текст;
				КонецЦикла;
				Сообщить(ТекстОшибки);
			Иначе
				ТекстОшибки = "Ошибка при создании документа " + ДокументОбъект.Метаданные().Синоним + "" + Символы.ПС;
				Сообщить(ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли;
			#КонецОбласти
			ВозВрат Ложь;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	#КонецОбласти
	
	ВозВрат Истина;
	
КонецФункции

//Лобашова 89291 23.07.2019 +
Функция  ПолучитьОбращение()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасписаниеКонсультацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	РасписаниеКонсультацийСрезПоследних.ДатаВремяНачала КАК ДатаВремяНачала,
		|	РасписаниеКонсультацийСрезПоследних.Событие КАК Событие
		|ИЗ
		|	РегистрСведений.РасписаниеКонсультаций.СрезПоследних КАК РасписаниеКонсультацийСрезПоследних
		|ГДЕ
		|	РасписаниеКонсультацийСрезПоследних.Сотрудник = &Сотрудник
		|	И РасписаниеКонсультацийСрезПоследних.ДатаВремяНачала = &ДатаВремяНачала";
	
	Запрос.УстановитьПараметр("ДатаВремяНачала", ДатаВремяНачала);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Событие;
	КонецЦикла;
	Возврат Документы.Обращение.ПустаяСсылка();
КонецФункции
//Лобашова 89291 23.07.2019 -
